load-testing/k6/results/auth-500rps.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load-testing/k6/stress/auth.stress.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m30s max duration (incl. graceful stop):
              * stress_test: 500.00 iterations/s for 1m0s (maxVUs: 200-500, gracefulStop: 30s)


running (0m01.0s), 284/285 VUs, 0 complete and 0 interrupted iterations
stress_test   [   2% ] 284/285 VUs  0m01.0s/1m0s  500.00 iters/s

running (0m02.0s), 439/440 VUs, 1 complete and 0 interrupted iterations
stress_test   [   3% ] 439/440 VUs  0m02.0s/1m0s  500.00 iters/s

running (0m03.0s), 500/500 VUs, 13 complete and 0 interrupted iterations
stress_test   [   5% ] 500/500 VUs  0m03.0s/1m0s  500.00 iters/s

running (0m04.0s), 500/500 VUs, 101 complete and 0 interrupted iterations
stress_test   [   7% ] 500/500 VUs  0m04.0s/1m0s  500.00 iters/s

running (0m05.0s), 494/500 VUs, 314 complete and 0 interrupted iterations
stress_test   [   8% ] 494/500 VUs  0m05.0s/1m0s  500.00 iters/s

running (0m06.0s), 500/500 VUs, 404 complete and 0 interrupted iterations
stress_test   [  10% ] 500/500 VUs  0m06.0s/1m0s  500.00 iters/s

running (0m07.0s), 500/500 VUs, 438 complete and 0 interrupted iterations
stress_test   [  12% ] 500/500 VUs  0m07.0s/1m0s  500.00 iters/s

running (0m08.0s), 492/500 VUs, 518 complete and 0 interrupted iterations
stress_test   [  13% ] 492/500 VUs  0m08.0s/1m0s  500.00 iters/s

running (0m09.0s), 500/500 VUs, 826 complete and 0 interrupted iterations
stress_test   [  15% ] 500/500 VUs  0m09.0s/1m0s  500.00 iters/s

running (0m10.0s), 500/500 VUs, 845 complete and 0 interrupted iterations
stress_test   [  17% ] 500/500 VUs  0m10.0s/1m0s  500.00 iters/s

running (0m11.0s), 500/500 VUs, 862 complete and 0 interrupted iterations
stress_test   [  18% ] 500/500 VUs  0m11.0s/1m0s  500.00 iters/s

running (0m12.0s), 441/500 VUs, 1120 complete and 0 interrupted iterations
stress_test   [  20% ] 441/500 VUs  0m12.0s/1m0s  500.00 iters/s

running (0m13.0s), 500/500 VUs, 1249 complete and 0 interrupted iterations
stress_test   [  22% ] 500/500 VUs  0m13.0s/1m0s  500.00 iters/s

running (0m14.0s), 500/500 VUs, 1271 complete and 0 interrupted iterations
stress_test   [  23% ] 500/500 VUs  0m14.0s/1m0s  500.00 iters/s

running (0m15.0s), 500/500 VUs, 1349 complete and 0 interrupted iterations
stress_test   [  25% ] 500/500 VUs  0m15.0s/1m0s  500.00 iters/s

running (0m16.0s), 500/500 VUs, 1562 complete and 0 interrupted iterations
stress_test   [  27% ] 500/500 VUs  0m16.0s/1m0s  500.00 iters/s

running (0m17.0s), 500/500 VUs, 1664 complete and 0 interrupted iterations
stress_test   [  28% ] 500/500 VUs  0m17.0s/1m0s  500.00 iters/s

running (0m18.0s), 500/500 VUs, 1723 complete and 0 interrupted iterations
stress_test   [  30% ] 500/500 VUs  0m18.0s/1m0s  500.00 iters/s

running (0m19.0s), 500/500 VUs, 1803 complete and 0 interrupted iterations
stress_test   [  32% ] 500/500 VUs  0m19.0s/1m0s  500.00 iters/s

running (0m20.0s), 500/500 VUs, 2009 complete and 0 interrupted iterations
stress_test   [  33% ] 500/500 VUs  0m20.0s/1m0s  500.00 iters/s

running (0m21.0s), 500/500 VUs, 2116 complete and 0 interrupted iterations
stress_test   [  35% ] 500/500 VUs  0m21.0s/1m0s  500.00 iters/s

running (0m22.0s), 500/500 VUs, 2170 complete and 0 interrupted iterations
stress_test   [  37% ] 500/500 VUs  0m22.0s/1m0s  500.00 iters/s

running (0m23.0s), 500/500 VUs, 2284 complete and 0 interrupted iterations
stress_test   [  38% ] 500/500 VUs  0m23.0s/1m0s  500.00 iters/s

running (0m24.0s), 499/500 VUs, 2476 complete and 0 interrupted iterations
stress_test   [  40% ] 499/500 VUs  0m24.0s/1m0s  500.00 iters/s

running (0m25.0s), 500/500 VUs, 2573 complete and 0 interrupted iterations
stress_test   [  42% ] 500/500 VUs  0m25.0s/1m0s  500.00 iters/s

running (0m26.0s), 500/500 VUs, 2630 complete and 0 interrupted iterations
stress_test   [  43% ] 500/500 VUs  0m26.0s/1m0s  500.00 iters/s

running (0m27.0s), 498/500 VUs, 2735 complete and 0 interrupted iterations
stress_test   [  45% ] 498/500 VUs  0m27.0s/1m0s  500.00 iters/s

running (0m28.0s), 499/500 VUs, 2921 complete and 0 interrupted iterations
stress_test   [  47% ] 499/500 VUs  0m28.0s/1m0s  500.00 iters/s

running (0m29.0s), 500/500 VUs, 3020 complete and 0 interrupted iterations
stress_test   [  48% ] 500/500 VUs  0m29.0s/1m0s  500.00 iters/s

running (0m30.0s), 500/500 VUs, 3076 complete and 0 interrupted iterations
stress_test   [  50% ] 500/500 VUs  0m30.0s/1m0s  500.00 iters/s

running (0m31.0s), 499/500 VUs, 3224 complete and 0 interrupted iterations
stress_test   [  52% ] 499/500 VUs  0m31.0s/1m0s  500.00 iters/s

running (0m32.0s), 499/500 VUs, 3361 complete and 0 interrupted iterations
stress_test   [  53% ] 499/500 VUs  0m32.0s/1m0s  500.00 iters/s

running (0m33.0s), 500/500 VUs, 3436 complete and 0 interrupted iterations
stress_test   [  55% ] 500/500 VUs  0m33.0s/1m0s  500.00 iters/s

running (0m34.0s), 498/500 VUs, 3526 complete and 0 interrupted iterations
stress_test   [  57% ] 498/500 VUs  0m34.0s/1m0s  500.00 iters/s

running (0m35.0s), 500/500 VUs, 3734 complete and 0 interrupted iterations
stress_test   [  58% ] 500/500 VUs  0m35.0s/1m0s  500.00 iters/s

running (0m36.0s), 500/500 VUs, 3824 complete and 0 interrupted iterations
stress_test   [  60% ] 500/500 VUs  0m36.0s/1m0s  500.00 iters/s

running (0m37.0s), 500/500 VUs, 3870 complete and 0 interrupted iterations
stress_test   [  62% ] 500/500 VUs  0m37.0s/1m0s  500.00 iters/s

running (0m38.1s), 495/500 VUs, 4014 complete and 0 interrupted iterations
stress_test   [  63% ] 495/500 VUs  0m38.1s/1m0s  500.00 iters/s

running (0m39.0s), 500/500 VUs, 4226 complete and 0 interrupted iterations
stress_test   [  65% ] 500/500 VUs  0m39.0s/1m0s  500.00 iters/s

running (0m40.0s), 500/500 VUs, 4272 complete and 0 interrupted iterations
stress_test   [  67% ] 500/500 VUs  0m40.0s/1m0s  500.00 iters/s

running (0m41.0s), 500/500 VUs, 4315 complete and 0 interrupted iterations
stress_test   [  68% ] 500/500 VUs  0m41.0s/1m0s  500.00 iters/s

running (0m42.0s), 497/500 VUs, 4623 complete and 0 interrupted iterations
stress_test   [  70% ] 497/500 VUs  0m42.0s/1m0s  500.00 iters/s

running (0m43.0s), 500/500 VUs, 4670 complete and 0 interrupted iterations
stress_test   [  72% ] 500/500 VUs  0m43.0s/1m0s  500.00 iters/s

running (0m44.0s), 500/500 VUs, 4709 complete and 0 interrupted iterations
stress_test   [  73% ] 500/500 VUs  0m44.0s/1m0s  500.00 iters/s

running (0m45.0s), 477/500 VUs, 4863 complete and 0 interrupted iterations
stress_test   [  75% ] 477/500 VUs  0m45.0s/1m0s  500.00 iters/s

running (0m46.0s), 500/500 VUs, 5083 complete and 0 interrupted iterations
stress_test   [  77% ] 500/500 VUs  0m46.0s/1m0s  500.00 iters/s

running (0m47.0s), 500/500 VUs, 5108 complete and 0 interrupted iterations
stress_test   [  78% ] 500/500 VUs  0m47.0s/1m0s  500.00 iters/s

running (0m48.0s), 500/500 VUs, 5140 complete and 0 interrupted iterations
stress_test   [  80% ] 500/500 VUs  0m48.0s/1m0s  500.00 iters/s

running (0m49.0s), 492/500 VUs, 5441 complete and 0 interrupted iterations
stress_test   [  82% ] 492/500 VUs  0m49.0s/1m0s  500.00 iters/s

running (0m50.0s), 500/500 VUs, 5512 complete and 0 interrupted iterations
stress_test   [  83% ] 500/500 VUs  0m50.0s/1m0s  500.00 iters/s

running (0m51.0s), 500/500 VUs, 5537 complete and 0 interrupted iterations
stress_test   [  85% ] 500/500 VUs  0m51.0s/1m0s  500.00 iters/s

running (0m52.0s), 500/500 VUs, 5621 complete and 0 interrupted iterations
stress_test   [  87% ] 500/500 VUs  0m52.0s/1m0s  500.00 iters/s

running (0m53.0s), 500/500 VUs, 5872 complete and 0 interrupted iterations
stress_test   [  88% ] 500/500 VUs  0m53.0s/1m0s  500.00 iters/s

running (0m54.0s), 500/500 VUs, 5943 complete and 0 interrupted iterations
stress_test   [  90% ] 500/500 VUs  0m54.0s/1m0s  500.00 iters/s

running (0m55.0s), 500/500 VUs, 5997 complete and 0 interrupted iterations
stress_test   [  92% ] 500/500 VUs  0m55.0s/1m0s  500.00 iters/s

running (0m56.0s), 500/500 VUs, 6095 complete and 0 interrupted iterations
stress_test   [  93% ] 500/500 VUs  0m56.0s/1m0s  500.00 iters/s

running (0m57.0s), 500/500 VUs, 6347 complete and 0 interrupted iterations
stress_test   [  95% ] 500/500 VUs  0m57.0s/1m0s  500.00 iters/s

running (0m58.0s), 500/500 VUs, 6385 complete and 0 interrupted iterations
stress_test   [  97% ] 500/500 VUs  0m58.0s/1m0s  500.00 iters/s

running (0m59.0s), 500/500 VUs, 6439 complete and 0 interrupted iterations
stress_test   [  98% ] 500/500 VUs  0m59.0s/1m0s  500.00 iters/s

running (1m00.0s), 451/500 VUs, 6603 complete and 0 interrupted iterations
stress_test   [ 100% ] 451/500 VUs  1m00.0s/1m0s  500.00 iters/s

running (1m01.0s), 244/500 VUs, 6817 complete and 0 interrupted iterations
stress_test ↓ [ 100% ] 458/500 VUs  1m0s  500.00 iters/s

running (1m02.0s), 126/500 VUs, 6935 complete and 0 interrupted iterations
stress_test ↓ [ 100% ] 458/500 VUs  1m0s  500.00 iters/s


  █ THRESHOLDS 

    failures
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✗ 'p(95)<1500' p(95)=2.38s

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 21183   339.424369/s
    checks_succeeded...: 100.00% 21183 out of 21183
    checks_failed......: 0.00%   0 out of 21183

    ✓ login page status 200
    ✓ login redirect success
    ✓ logout redirect success

    CUSTOM
    failures.......................: 0.00%  0 out of 0

    HTTP
    http_req_duration..............: avg=810.67ms min=138µs med=448.4ms max=3.47s p(90)=2.15s p(95)=2.38s p(99)=2.8s 
      { expected_response:true }...: avg=810.67ms min=138µs med=448.4ms max=3.47s p(90)=2.15s p(95)=2.38s p(99)=2.8s 
    http_req_failed................: 0.00%  0 out of 28244
    http_reqs......................: 28244  452.565825/s

    EXECUTION
    dropped_iterations.............: 22939  367.561516/s
    iteration_duration.............: avg=4.24s    min=1.58s med=4.11s   max=6.61s p(90)=5.15s p(95)=5.55s p(99)=6.14s
    iterations.....................: 7061   113.141456/s
    vus............................: 125    min=125        max=500
    vus_max........................: 500    min=285        max=500

    NETWORK
    data_received..................: 62 MB  1.0 MB/s
    data_sent......................: 6.0 MB 96 kB/s



running (1m02.4s), 000/500 VUs, 7061 complete and 0 interrupted iterations
stress_test ✓ [ 100% ] 000/500 VUs  1m0s  500.00 iters/s